research/vita.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<!-- 2018-03-02 Fri 13:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../bjm.css" />
</head>
<body>
<div id="content">
<h1 class="title"></h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Thomas J. Faulkenberry, Ph.D.</h2>
<div class="outline-text-2" id="text-1">
<p>
Department of Psychological Sciences<br  />
Tarleton State University<br  />
Box T-0820, Stephenville, TX 76402<br  />
Phone: +1 (254) 968-9816<br  />
Email: faulkenberry@tarleton.edu<br  />
Website: <a href="http://tomfaulkenberry.github.io">http://tomfaulkenberry.github.io</a>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Education</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Ph.D., Psychology, Texas A&amp;M University – Commerce, 2010
</li>
<li>M.S., Mathematics, Oklahoma State University - 2002
</li>
<li>B.S. with highest honors, Mathematics, Southeastern Oklahoma State University, 2000
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Academic positions</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>2013-present: Assistant Professor, Department of Psychological Sciences, Tarleton State University
</li>
<li>2012-2013: Assistant Professor, Department of Mathematics, Texas A&amp;M University – Commerce
</li>
<li>2010-2012: Visiting Assistant Professor, Department of Psychology and Special Education, Texas A&amp;M University – Commerce
</li>
<li>2005-2010: Lecturer, Department of Mathematics, Texas A&amp;M University - Commerce
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Honors and awards</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>O. A. Grant Excellence in Teaching Award, Tarleton State University College of Education, 2018
</li>
<li>Faculty Excellence in Scholarship Award, Tarleton State University College of Education, 2016
</li>
<li>President's All-Purple Award, Tarleton State University, 2016
</li>
<li>Nominee, Bruce N. Chaloux Award for Early Career Excellence in Online Education, Sloan Consortium, 2015
</li>
<li>Fellow, The Psychonomic Society, 2014
</li>
<li>Texas A&amp;M University System Teaching Excellence Award, 2010-2011
</li>
<li>Best Graduate Student Presentation, Annual Research Symposium, TAMU-C, 2010
</li>
<li>O.H. Hamilton Fellowship in Mathematics, Oklahoma State University, 2002
</li>
<li>S. J. Scroggs Distinguished Graduate Fellowship, Oklahoma State University, 2001
</li>
<li>Regional University Scholarship (4 years), Southeastern Oklahoma State University, 1996
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Administrative activities</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>2011-2012: Director, Center for Undergraduate Research and Creative Activities, TAMU-C
</li>
<li>2010-2011: Director, Math &amp; Science Teacher Preparation Program (LeoTEACH), TAMU-C
</li>
</ul>
</div>
</div>
