research/vita.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Research publications</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Faulkenberry, T. J. (in press). Computing Bayes factors to measure evidence from experiments: An extension of the BIC approximation. To appear in <i>Biometrical Letters</i>.
</li>
<li>Faulkenberry, T. J. (in press). A simple method for teaching Bayesian hypothesis testing in the brain and behavioral sciences. To appear in <i>Journal of Undergraduate Neuroscience Education</i>.
</li>
<li>Frampton, A. R., &amp; Faulkenberry, T. J. (in press). Mental arithmetic processes: Testing the independence of encoding and calculation. To appear in <i>Journal of Psychological Inquiry</i>.
</li>
<li>Faulkenberry, T. J. (2017). A single-boundary accumulator model of response times in an arithmetic verification task. <i>Frontiers in Psychology</i>, <i>8:1225</i>. doi: <a href="http://dx.doi.org/10.3389/fpsyg.2017.01225">10.3389/fpsyg.2017.01225/</a>
</li>
<li>Faulkenberry, T. J., Cruise, A., &amp; Shaki, S. (2017). Reversing the manual digit bias in two-digit number comparison. <i>Experimental Psychology</i>, <i>64</i>, 191-204.  doi: <a href="http://dx.doi.org/10.1027/1618-3169/a000365">10.1027/1618-3169/a000365</a>
</li>
<li>Sobel, K. V., Puri, A. M., Faulkenberry, T. J., &amp; Dague, T. D. (2017). Visual search for conjunctions of physical and numerical size shows that they are processed independently. <i>Journal of Experimental Psychology: Human Perception &amp; Performance</i>, <i>43</i>, 444-453. doi: <a href="http://dx.doi.org/10.1037/xhp0000323">10.1037/xhp0000323</a>
</li>
<li>Faulkenberry, T. J., &amp; Tummolini, L. (2016). Commentary: Is there any Influence of Variations in Context on Object-Affordance Effects in Schizophrenia? Perception of Property and Goals of Action). <i>Frontiers in Psychology</i>, <i>7:1915</i>. doi: <a href="http://dx.doi.org/10.3389/fpsyg.2016.01915">10.3389/fpsyg.2016.01915</a>
</li>
<li>Faulkenberry, T. J. (2016). Testing a direct mapping versus competition account of response dynamics in number comparison. <i>Journal of Cognitive Psychology</i>, <i>28</i>, 825-842. doi: <a href="http://dx.doi.org/10.1080/20445911.2016.1191504">10.1080/20445911.2016.1191504</a>
</li>
<li>Sobel, K. V., Puri, A. M., &amp; Faulkenberry, T. J. (2016). Bottom-up and top-down attentional contributions to the size-congruity effect. <i>Attention, Perception, &amp; Psychophysics</i>, <i>78</i>, 1324-1336. doi: <a href="http://dx.doi.org/10.3758/s13414-016-1098-3">10.3758/s13414-016-1098-3</a>
</li>
<li>Faulkenberry, T. J., Cruise, A., Lavro, D., &amp; Shaki, S. (2016). Response trajectories capture the continuous dynamics of the size congruity effect. <i>Acta Psychologica</i>, <i>163</i>, 114-123. doi: <a href="http://dx.doi.org/10.1016/j.actpsy.2015.11.010">10.1016/j.actpsy.2015.11.010</a>
</li>
<li>Faulkenberry, T. J., Montgomery, S. A., &amp; Tennes, S. N. (2015). Response trajectories reveal the temporal dynamics of fraction representations. <i>Acta Psychologica</i>, <i>159</i>, 100-107. doi: <a href="http://dx.doi.org/10.1016/j.actpsy.2015.05.013">10.1016/j.actpsy.2015.05.013</a>
</li>
<li>Faulkenberry, T. J., &amp; Rey, A. R. (2014). Extending the reach of mousetracking in numerical cognition: A comment on Fischer and Hartmann (2014). <i>Frontiers in Psychology</i>, <i>5</i>:1436. doi: <a href="http://dx.doi.org/10.3389/fpsyg.2014.01436">10.3389/fpsyg.2014.01436</a>
</li>
<li>Faulkenberry, T. J. (2014). Hand movements reflect competitive processing in numerical cognition. <i>Canadian Journal of Experimental Psychology</i>, <i>68</i>, 147-151. doi: <a href="http://dx.doi.org/10.1037/cep0000021">10.1037/cep0000021</a>
</li>
<li>Faulkenberry, T. J., &amp; Geye, T. L. (2014). The cognitive origins of mathematics learning disability: A review. <i>The Rehabilitation Professional</i>, <i>22</i> (1), 9-16.
</li>
<li>Faulkenberry, T. J., &amp; Faulkenberry, E. D. (2013). Teaching integer arithmetic without rules: An embodied approach. <i>Oklahoma Journal of School Mathematics</i>, <i>5</i> (2), 5-14.
</li>
<li>Faulkenberry, T. J., (2013). The conceptual/procedural distinction belongs to strategies, not tasks: A comment on Gabriel et al. (2013). <i>Frontiers in Psychology</i>, <i>4</i>:820. doi: <a href="http://dx.doi.org/10.3389/fpsyg.2013.00820">10.3389/fpsyg.2013.00820</a>
</li>
<li>Faulkenberry, T. J., &amp; Montgomery, S. A. (2013). The primacy of fraction components in adults’ numerical judgements. In Reeder, S. L. and Matney, G. T. (Eds.). <i>Proceedings of the 40th Annual Meeting of the Research Council on Mathematics Learning</i> (pp. 155-162). Tulsa, OK: RCML
</li>
<li>Faulkenberry, T. J. (2013). How the hand mirrors the mind: The embodiment of numerical cognition. In Reeder, S. L. and Matney, G. T. (Eds.). <i>Proceedings of the 40th Annual Meeting of the Research Council on Mathematics Learning</i> (pp. 205-212). Tulsa, OK: RCML
</li>
<li>Faulkenberry, E. D., &amp; Faulkenberry, T. J. (2012). Do you see what I see? An exploration of self-perception in the classroom. In S. L. Reeder (Ed.), <i>Proceedings of the 39th Annual Meeting of the Research Council on Mathematics Learning</i> (pp. 121-126). Charlotte, NC: RCML.
</li>
<li>Faulkenberry, T. J., &amp; Pierce, B. H. (2011). Mental representations in fraction comparison: Holistic versus component-based strategies. <i>Experimental Psychology</i>, <i>58</i>, 480-489. doi: <a href="http://dx.doi.org/10.1027/1618-3169/a000116">10.1027/1618-3169/a000116</a>
</li>
<li>Faulkenberry, T. J. (2011). Individual differences in mental representations of fraction magnitude. In S. Reeder (Ed.) <i>Proceedings of the 38th Annual Meeting of the Research Council on Mathematics Learning</i> (pp. 136-143). Cincinnati, OH: RCML.
</li>
<li>Faulkenberry, E. D., &amp; Faulkenberry, T. J. (2010). Transforming the way we teach function transformations. <i>Mathematics Teacher</i>, <i>104</i>, 29-33.
</li>
<li>Faulkenberry, T. J. (2010). The working memory demands of simple fraction strate- gies. In S. Reeder (Ed.) <i>Proceedings of the 37th Annual Meeting of the Research Council on Mathematics Learning</i> (pp. 84-89). Conway, AR: RCML.
</li>
<li>Faulkenberry, E. D. &amp; Faulkenberry, T. J. (2006). Constructivism in mathematics education: A historical and personal perspective. <i>The Texas Science Teacher</i>, <i>35</i>, 17- 22.
</li>
</ol>
</div>
</div>
