research/vita.org
** Abstracts, columns, and book reviews
1. Faulkenberry, T. J. (2017). A single-boundary accumulator model of decisions in a mental arithmetic task. /Abstracts of the Psychonomic Society/, /22/, 27.
1. Geye, T. L., & Faulkenberry, T. J. (2017). Computer mousetracking reveals the facilitation and interference components of the size congruity effect. /Abstracts of the Psychonomic Society/, /22/, 106.
1. Bowman, K. A., & Faulkenberry, T. J. (2017). The dynamics of spatial-operational momentum in mental arithmetic. /Abstracts of the Psychonomic Society/, /22/, 188.
1. Faulkenberry, T. J. (2016). Motor dynamics support a competition model of number processing. /Abstracts of the Psychonomic Society/, /21/, 26.
1. Bowman, K. A., & Faulkenberry, T. J. (2016). Testing competing models of two-digit number representation: Decomposed versus holistic processing. /Abstracts of the Psychonomic Society/, /21/, 285. 
1. Faulkenberry, T. J. (2016). Decoding the development of mathematical thinking: A book review of /Development of Mathematical Thinking: Neural Substrates and Genetic Influences/. /PsycCRITIQUES/, /61/ (31). doi: [[http://dx.doi.org/10.1037/a0040434][10.1037/a0040434]]
1. Faulkenberry, T. J. (2016). Undergraduate students: An endangered resource? /SWPA Newsletter/
1. Faulkenberry, T. J., Cruise, A., Lavro, D., & Shaki, S. (2015). Response trajectories support a late-interaction model of the size-congruity effect. /Canadian Journal of Experimental Psychology, 69/, 346.
1. Faulkenberry, T. J., Cruise, A., & Shaki, S. (2015). Reversing the manual decade bias in two-digit number comparison. /Abstracts of the Psychonomic Society, 20/, 39.
1. Geye, T. L, & Faulkenberry, T. J. (2015). Response trajectories capture individual differences in a size congruity task. /Abstracts of the Psychonomic Society, 20/, 249.
1. Faulkenberry, T. J., Cruise, A., Lavro, D., & Shaki, S. (2014). Response trajectories capture the continuous dynamics of the size-congruity effect. /Abstracts of the Psychonomic Society, 19/, 53.
1. Faulkenberry, T. J. (2013). Measuring the working memory requirements of mental arithmetic. /Canadian Journal of Experimental Psychology, 67/, 281.
1. Faulkenberry, T. J. (2013). Measuring the working memory requirements of mental arithmetic. /Abstracts of the Psychonomic Society, 18/, 203-204.
1. Faulkenberry, T. J. (2012). The temporal dynamics of fraction representations: Components are processed first. /Canadian Journal of Experimental Psychology, 66/, 310.
1. Faulkenberry, T. J. & Montgomery, S. A. (2012). The primacy of components in numerical fractions. /Abstracts of the Psychonomic Society, 17/, 206.
1. Faulkenberry, T. J. (2011). Brain-based mathematics: Promising practice or hopeful hype? /RCML Intersection Points, 35/ (3), 9-10.
1. Faulkenberry, T. J. & Kelsey, A. R. (2011). Working memory and strategic performance in fraction comparison. /Canadian Journal of Experimental Psychology, 65/, 311-311.
1. Faulkenberry, T. J. (2011). The dynamics of the SNARC effect: Evidence from mouse tracking. /Canadian Journal of Experimental Psychology, 65/, 316-316.
1. Faulkenberry, T. J. (2011). Motor dynamics in numerical representations: Evidence from mouse tracking. /Abstracts of the Psychonomic Society, 16/, 76-76.
1. Faulkenberry, T. J. (2010). The roles of phonological and visuo-spatial working memory resources in simple fraction strategies. /Canadian Journal of Experimental Psychology, 64/, 302-302.
1. Lu, S. Wakefield, L. & Faulkenberry, T. J. (2006). The roles of beginnings, overlap, and ends in event temporal relations. /Abstracts of the Psychonomic Society, 11/, 9-9.

