research/vita.html

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Abstracts, columns, and book reviews</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>Faulkenberry, T. J. (2017). A single-boundary accumulator model of decisions in a mental arithmetic task. <i>Abstracts of the Psychonomic Society</i>, <i>22</i>, 27.
</li>
<li>Geye, T. L., &amp; Faulkenberry, T. J. (2017). Computer mousetracking reveals the facilitation and interference components of the size congruity effect. <i>Abstracts of the Psychonomic Society</i>, <i>22</i>, 106.
</li>
<li>Bowman, K. A., &amp; Faulkenberry, T. J. (2017). The dynamics of spatial-operational momentum in mental arithmetic. <i>Abstracts of the Psychonomic Society</i>, <i>22</i>, 188.
</li>
<li>Faulkenberry, T. J. (2016). Motor dynamics support a competition model of number processing. <i>Abstracts of the Psychonomic Society</i>, <i>21</i>, 26.
</li>
<li>Bowman, K. A., &amp; Faulkenberry, T. J. (2016). Testing competing models of two-digit number representation: Decomposed versus holistic processing. <i>Abstracts of the Psychonomic Society</i>, <i>21</i>, 285. 
</li>
<li>Faulkenberry, T. J. (2016). Decoding the development of mathematical thinking: A book review of <i>Development of Mathematical Thinking: Neural Substrates and Genetic Influences</i>. <i>PsycCRITIQUES</i>, <i>61</i> (31). doi: <a href="http://dx.doi.org/10.1037/a0040434">10.1037/a0040434</a>
</li>
<li>Faulkenberry, T. J. (2016). Undergraduate students: An endangered resource? <i>SWPA Newsletter</i>
</li>
<li>Faulkenberry, T. J., Cruise, A., Lavro, D., &amp; Shaki, S. (2015). Response trajectories support a late-interaction model of the size-congruity effect. <i>Canadian Journal of Experimental Psychology, 69</i>, 346.
</li>
<li>Faulkenberry, T. J., Cruise, A., &amp; Shaki, S. (2015). Reversing the manual decade bias in two-digit number comparison. <i>Abstracts of the Psychonomic Society, 20</i>, 39.
</li>
<li>Geye, T. L, &amp; Faulkenberry, T. J. (2015). Response trajectories capture individual differences in a size congruity task. <i>Abstracts of the Psychonomic Society, 20</i>, 249.
</li>
<li>Faulkenberry, T. J., Cruise, A., Lavro, D., &amp; Shaki, S. (2014). Response trajectories capture the continuous dynamics of the size-congruity effect. <i>Abstracts of the Psychonomic Society, 19</i>, 53.
</li>
<li>Faulkenberry, T. J. (2013). Measuring the working memory requirements of mental arithmetic. <i>Canadian Journal of Experimental Psychology, 67</i>, 281.
</li>
<li>Faulkenberry, T. J. (2013). Measuring the working memory requirements of mental arithmetic. <i>Abstracts of the Psychonomic Society, 18</i>, 203-204.
</li>
<li>Faulkenberry, T. J. (2012). The temporal dynamics of fraction representations: Components are processed first. <i>Canadian Journal of Experimental Psychology, 66</i>, 310.
</li>
<li>Faulkenberry, T. J. &amp; Montgomery, S. A. (2012). The primacy of components in numerical fractions. <i>Abstracts of the Psychonomic Society, 17</i>, 206.
</li>
<li>Faulkenberry, T. J. (2011). Brain-based mathematics: Promising practice or hopeful hype? <i>RCML Intersection Points, 35</i> (3), 9-10.
</li>
<li>Faulkenberry, T. J. &amp; Kelsey, A. R. (2011). Working memory and strategic performance in fraction comparison. <i>Canadian Journal of Experimental Psychology, 65</i>, 311-311.
</li>
<li>Faulkenberry, T. J. (2011). The dynamics of the SNARC effect: Evidence from mouse tracking. <i>Canadian Journal of Experimental Psychology, 65</i>, 316-316.
</li>
<li>Faulkenberry, T. J. (2011). Motor dynamics in numerical representations: Evidence from mouse tracking. <i>Abstracts of the Psychonomic Society, 16</i>, 76-76.
</li>
<li>Faulkenberry, T. J. (2010). The roles of phonological and visuo-spatial working memory resources in simple fraction strategies. <i>Canadian Journal of Experimental Psychology, 64</i>, 302-302.
</li>
<li>Lu, S. Wakefield, L. &amp; Faulkenberry, T. J. (2006). The roles of beginnings, overlap, and ends in event temporal relations. <i>Abstracts of the Psychonomic Society, 11</i>, 9-9.
</li>
</ol>
</div>
</div>
