research/vita.html

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">Research Funding</h3>
<div class="outline-text-3" id="text-1-9">
<p>
<i>PI unless otherwise noted.  Total funding = $228,668.</i>
</p>

<ul class="org-ul">
<li>2018 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>Using hierarchical Bayesian modeling to uncover the cognitive mechanisms underlying associations between number and space</i>
</li>
<li>2017 (fall), Tarleton State University, Faculty Development Grant, $1000, <i>Travel: Psychonomic Society Meeting in Vancouver, BC</i>
</li>
<li>2017 (summer), Tarleton State University, First Year Research Experience (FYRE), $4000, <i>Using the Wiener diffusion process to model response time distributions in a numerical decision task</i>  
</li>
<li>2015 (fall), Tarleton State University, Faculty Development Grant, $750, <i>Travel: Psychonomic Society Meeting in Boston, MA</i>
</li>
<li>2016 (summer), Tarleton State University, First Year Research Experience (FYRE), $6500, <i>Investigating the dynamics of operator preview effects in mental arithmetic</i>
</li>
<li>2016 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $4000, <i>Testing competing models of two-digit number representation: Decomposed, holistic, or hybrid?</i>
</li>
<li>2016 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>Testing decomposed versus holistic fraction representations via an implicit priming task</i>
</li>
<li>2016 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>Is memory "retrieval" in single digit arithmetic really just rapid shifts of attention along a mental number line?</i>
</li>
<li>2015 (fall), Tarleton State University, Faculty Development Grant, $750, <i>Travel: Psychonomic Society Meeting in Chicago, Illinois</i>
</li>
<li>2015 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>The effects of numerical fluency on mental representations of two-digit numbers.</i>
</li>
<li>2015 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>Spatial-numerical associations in mental arithmetic.</i>
</li>
<li>2015 (summer), Tarleton State University, First Year Research Experience (FYRE), $6500, <i>Mental representations of two-digit numbers</i>
</li>
<li>2015 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $3500, <i>Spatial-numerical associations in mental arithmetic.</i>
</li>
<li>2015 (spring), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>Are the stages of cognitive arithmetic additive or interactive? The effects of numerical surface form on an addition production task.</i>
</li>
<li>2015 (spring), Society for the Teaching of Psychology, Early Career Travel Grant, $350, <i>Travel: Southwestern Teachers of Psychology Conference in Wichita, Kansas</i>
</li>
<li>2014-2015, Tarleton State University, Organized Research Grant, $9560, <i>Investigating the cognitive factors behind mathematics learning disability</i>
</li>
<li>2014 (fall), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $1000, <i>The effects of numerical surface form on strategies for mental arithmetic verification</i>
</li>
<li>2014 (fall), Tarleton State University, Faculty Development Grant, $508, <i>Travel: Psychonomic Society Meeting in Long Beach, California</i>
</li>
<li>2014 (summer), Tarleton State University, OSRCA Undergrad. Res. Assistantship, $3500, <i>Using hand tracking to analyze mental representations of fractions</i>
</li>
<li>2014 (spring), Tarleton State University, QEP Startup Grant, $1500, <i>Applied Learning Experience: Undergraduate Research in Mathematical Cognition</i>
</li>
<li>2013 (fall), Tarleton State University, Faculty Development Grant, $630, <i>Travel: Psychonomic Society Meeting in Toronto, Ontario</i>
</li>
<li>2012-2013, National Science Foundation: Robert Noyce Scholarship Program, $174,020 (Co-PI with Ben Jang), <i>Building the Capacity for Math and Science Teacher Training</i>
</li>
<li>2010, Texas A&amp;M University – Commerce, OSP Research Grant, $5000, <i>Mouse Tracking in Mathematical Cognition</i>
</li>
<li>2008, Texas A&amp;M University – Commerce, OSP Mini Grant, $600, <i>IoLab Button Box for Psyscope X</i>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10">Editorial roles</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>Associate Editor (2017-present): <i>Journal of European Psychology Students</i>
</li>
<li>Associate Editor (2017-present): <i>Frontiers in Psychology: Cognition Section</i>
</li>
<li>Associate Editor (2016-present): <i>Journal of Psychological Inquiry</i>
</li>
<li>Guest Editor (2016-present): <i>Journal of Numerical Cognition</i>
</li>
<li>Review Editor (2016-2017): <i>Frontiers in Psychology: Cognition Section</i>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11">Reviewing</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Ad hoc reviewer for the following journals: <i>Acta Psychologica, Attention, Perception, &amp; Psychophysics, Behavior Research Methods, British Journal of Developmental Psychology, Canadian Journal of Experimental Psychology, Cognitive Processing, Cognition, Cognitive Science, Frontiers in Psychology, Journal of Experimental Child Psychology, Journal of Numerical Cognition, Learning and Individual Differences, Mathematics Teacher, Mathematics Teaching in the Middle School, Proceedings of the Research Council on Mathematics Learning, Psychonomic Bulletin and Review, Quarterly Journal of Experimental Psychology</i>
</li>
<li>External Examiner
<ul class="org-ul">
<li>2017, Corinna Jones, Ph.D., University of Huddersfield, UK
</li>
</ul>
</li>
<li>Panelist/Reader
<ul class="org-ul">
<li>2017, Judge, American Statistical Association Statistics Project Competition
</li>
<li>2015-2017, Reader, AP Statistics Exam, Kansas City, MO
</li>
<li>2012-2015, Panelist, National Science Foundation, Washington, DC
</li>
</ul>
</li>

<li>Textbook reviewer for Psychology Press, Routledge, Sage, Taylor &amp; Francis
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12">Professional Memberships</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>American Mathematical Society
</li>
<li>American Statistical Association
</li>
<li>Canadian Society for Brain, Behaviour, &amp; Cognitive Science
</li>
<li>Mathematical Cognition and Learning Society
</li>
<li>Psychonomic Society
</li>
<li>Society for Mathematical Psychology
</li>
<li>Southwestern Psychological Association (SWPA)
</li>
</ul>
</div>
</div>
