research/vita.org
** Professional Service

National/regional service 

- Treasurer, Southwestern Psychological Association (appointed, 2017-2020)	
- Texas Representative, Southwestern Psychological Association (elected, 2015-2017)
- Steering Committee Member, Southwestern Teachers of Psychology (appointed, 2015-2016)
- Nominating Committee Chair, Southwestern Psychological Association (appointed, 2015)
- Advisory Board Member, Collaborative Replications and Education Project (CREP) (appointed, 2014-2016)
- Session Chair, Psychonomics Annual Meeting (2014, 2015)
- Session Chair, Southwestern Psychological Association Meeting (2015)
- Conference Committee Member, Research Council on Mathematics Learning (elected, 2012-2015)
	
University service

- Faculty Fellow, Tarleton (2016-present)
- Official Advisor for Alpha Chi Honor Society, Tarleton (2015-present)
- State Non-Funded Course Review Group, Member, Tarleton (2015-present)
- Honors Advisory Committee for College of Education, Member, Tarleton (2015-2017)
- University Research Committee, Member, Tarleton (2015-present)
- Student Research and Creative Activity Advisory Committee, Member, Tarleton (2013-present)
- Session Chair and Judge, TAMUS Pathways Symposium (2017)
- University ALE Task Force, Member, Tarleton (2016-2017)
- Curriculum Committee, College of Education, Member, Tarleton (2014-2017)
- Greater Expectations Task Force, Member, Tarleton (2014-2015)
- Student Marshall, College of Education Commencement, Tarleton (Sp14, Sp15, Fa15)
- Session Chair and Judge, Tarleton Research Symposium (2014, 2015)
- External Search Committee member, Department of Engineering, TAMU-C (2012-2013)
- University Honors Council, Member, TAMU-C (2012-2013)
- Liberal Studies Committee, Member, TAMU-C (2012-2013)
- Developmental Appeals Committee, Member, TAMU-C (2010-2012)		

Department service

- Organized /Psychological Sciences Day/, Tarleton, (2017-2018)
- Search Committee Chair, Department of Psychological Sciences, Tarleton (2014, 2015)
- Texan Orientation, Department of Psychological Sciences, Tarleton (2014-2018)
- Texan Tour Speaker, Department of Psychological Sciences, Tarleton (2015)
- Organizer, Psychology Department Seminar, Tarleton (2013-2014)
- Psychology Scholarship Committee, Tarleton (2013-2015)
- Psychology Undergraduate Programs Committee, Member, TAMU-C (2011-2012)
  
** Courses Taught

Tarleton State University

- PSYC 2301: General Psychology (Honors), Fall 13,14,15
- PSYC 2301: General Psychology, Summer 14,15
- PSYC 3301: Psychology of Learning, Fall 13,14,15,16
- PSYC 3303: Educational Psychology, Fall 13; Spring 14; Summer 14,15,16
- PSYC 3309: Writing in Psychology, Spring 16
- PSYC 3320: Psycholinguistics, Summer 17
- PSYC 3330: Elem Statistics for Behav Science, Fall 14,15,16,17; Spring 15,16,17,18; Su 16,17
- PSYC 3435: Prin Research for Behav Science, Fall 14,15,16,17; Sp 15,16,17; Su 15,16,17
- PSYC 4386: Advanced Statistical Methods, Spring 14
- PSYC 4386: Methods in Experimental Psychology, Spring 15; Fall 15
- PSYC 4386: Problems in Numerical Cognition, Fall 15
- PSYC 5303: Theories of Learning, Fall 16
- HONS 3385: Honors Seminar (Numerical Cognition), Spring 15
- PSYC 5301: Research Methods, Spring 14,15,17,18
- PSYC 5304: Human Development, Spring 14
- PSYC 5316: Advanced Quantitative Methods, Fall 17
- PSYC 5379: Advanced Psycholinguistics, Summer 17
- EDAD 6313: Statistical Methods for Educational Leadership, Spring 16

** Student Mentoring

*** Masters Thesis Chair
- Chelsea Bradley (Applied Psychology, Tarleton, in progress)
- Savannah Hines (Applied Psychology, Tarleton, in progress)

*** Doctoral Committees

- Matthew Herzberg (Educational Leadership, Tarleton, in progress)
- Jeni McNeely (Educational Leadership, Tarleton, graduated 2016)
- Trina Geye (Psychology, TAMU-C, graduated 2016)
- Stephen McDaniel (Psychology, TAMU-C, in progress)
- Beth Nikopoulous (Psychology, TAMU-C, graduated 2015)
- Donna Peters (Psychology, TAMU-C, graduated 2013)
	
*** Masters Committees

- Kody Lamb (Applied Psychology, Tarleton, in progress)
- Trina Geye (Psychology, TAMU-C, graduated 2015)
- Beth Nikopoulous (Psychology, TAMU-C, graduated 2013)
- Heather Oetker (Special Education, TAMU-C, graduated 2012)
- Joshua Patterson (Mathematics, TAMU-C, graduated 2011)

*** Honors Thesis Chair

- Anissa Eid (Psychology, tarleton, in progress), /Cognitive mechanisms underlying spatial-numerical associations/
- Paige Woodard (Psychology, Tarleton, graduated 2017), /Mental arithmetic: Relationship between encoding and calculation processes/
- Sarah Montgomery (High Honors in Psychology, TAMU-C, graduated 2013), /Measuring the Working Memory Requirements of Mental Arithmetic/
- Emily Dalton (Honors in Psychology, TAMU-C, graduated 2013), /The Effects of Generation on False Memory for Numbers/
- Kaytlin Reid (Honors in Interdisciplinary Studies, TAMU-C, graduated 2013), /The Role of Working Memory in Mental Fraction Computation/
- Douglas Boney (Honors in Mathematics, TAMU-C, graduated 2013), /Knot Polynomials/
- Samantha Reece (Honors in Sociology, TAMU-C, graduated 2012), /The Effects of Stereotype Threat on Cheating Behavior in Mathematics/

*** Honors Thesis Committees

- Carmen Phelps (English, TAMU-C, 2013)
- Morgan Lutz (Psychology, TAMU-C, 2013)
- Nick Bredberg (Physics, TAMU-C, 2012)
- Kallie Hinton (Mathematics Education, TAMU-C, 2011)
- Lindsey Preston (Mathematics Education, TAMU-C, 2011)

  
