research/vita.html

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13">Professional Service</h3>
<div class="outline-text-3" id="text-1-13">
<p>
National/regional service 
</p>

<ul class="org-ul">
<li>Treasurer, Southwestern Psychological Association (appointed, 2017-2020)        
</li>
<li>Texas Representative, Southwestern Psychological Association (elected, 2015-2017)
</li>
<li>Steering Committee Member, Southwestern Teachers of Psychology (appointed, 2015-2016)
</li>
<li>Nominating Committee Chair, Southwestern Psychological Association (appointed, 2015)
</li>
<li>Advisory Board Member, Collaborative Replications and Education Project (CREP) (appointed, 2014-2016)
</li>
<li>Session Chair, Psychonomics Annual Meeting (2014, 2015)
</li>
<li>Session Chair, Southwestern Psychological Association Meeting (2015)
</li>
<li>Conference Committee Member, Research Council on Mathematics Learning (elected, 2012-2015)
</li>
</ul>

<p>
University service
</p>

<ul class="org-ul">
<li>Faculty Fellow, Tarleton (2016-present)
</li>
<li>Official Advisor for Alpha Chi Honor Society, Tarleton (2015-present)
</li>
<li>State Non-Funded Course Review Group, Member, Tarleton (2015-present)
</li>
<li>Honors Advisory Committee for College of Education, Member, Tarleton (2015-2017)
</li>
<li>University Research Committee, Member, Tarleton (2015-present)
</li>
<li>Student Research and Creative Activity Advisory Committee, Member, Tarleton (2013-present)
</li>
<li>Session Chair and Judge, TAMUS Pathways Symposium (2017)
</li>
<li>University ALE Task Force, Member, Tarleton (2016-2017)
</li>
<li>Curriculum Committee, College of Education, Member, Tarleton (2014-2017)
</li>
<li>Greater Expectations Task Force, Member, Tarleton (2014-2015)
</li>
<li>Student Marshall, College of Education Commencement, Tarleton (Sp14, Sp15, Fa15)
</li>
<li>Session Chair and Judge, Tarleton Research Symposium (2014, 2015)
</li>
<li>External Search Committee member, Department of Engineering, TAMU-C (2012-2013)
</li>
<li>University Honors Council, Member, TAMU-C (2012-2013)
</li>
<li>Liberal Studies Committee, Member, TAMU-C (2012-2013)
</li>
<li>Developmental Appeals Committee, Member, TAMU-C (2010-2012)                
</li>
</ul>

<p>
Department service
</p>

<ul class="org-ul">
<li>Organized <i>Psychological Sciences Day</i>, Tarleton, (2017-2018)
</li>
<li>Search Committee Chair, Department of Psychological Sciences, Tarleton (2014, 2015)
</li>
<li>Texan Orientation, Department of Psychological Sciences, Tarleton (2014-2018)
</li>
<li>Texan Tour Speaker, Department of Psychological Sciences, Tarleton (2015)
</li>
<li>Organizer, Psychology Department Seminar, Tarleton (2013-2014)
</li>
<li>Psychology Scholarship Committee, Tarleton (2013-2015)
</li>
<li>Psychology Undergraduate Programs Committee, Member, TAMU-C (2011-2012)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14">Courses Taught</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Tarleton State University
</p>

<ul class="org-ul">
<li>PSYC 2301: General Psychology (Honors), Fall 13,14,15
</li>
<li>PSYC 2301: General Psychology, Summer 14,15
</li>
<li>PSYC 3301: Psychology of Learning, Fall 13,14,15,16
</li>
<li>PSYC 3303: Educational Psychology, Fall 13; Spring 14; Summer 14,15,16
</li>
<li>PSYC 3309: Writing in Psychology, Spring 16
</li>
<li>PSYC 3320: Psycholinguistics, Summer 17
</li>
<li>PSYC 3330: Elem Statistics for Behav Science, Fall 14,15,16,17; Spring 15,16,17,18; Su 16,17
</li>
<li>PSYC 3435: Prin Research for Behav Science, Fall 14,15,16,17; Sp 15,16,17; Su 15,16,17
</li>
<li>PSYC 4386: Advanced Statistical Methods, Spring 14
</li>
<li>PSYC 4386: Methods in Experimental Psychology, Spring 15; Fall 15
</li>
<li>PSYC 4386: Problems in Numerical Cognition, Fall 15
</li>
<li>PSYC 5303: Theories of Learning, Fall 16
</li>
<li>HONS 3385: Honors Seminar (Numerical Cognition), Spring 15
</li>
<li>PSYC 5301: Research Methods, Spring 14,15,17,18
</li>
<li>PSYC 5304: Human Development, Spring 14
</li>
<li>PSYC 5316: Advanced Quantitative Methods, Fall 17
</li>
<li>PSYC 5379: Advanced Psycholinguistics, Summer 17
</li>
<li>EDAD 6313: Statistical Methods for Educational Leadership, Spring 16
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-15" class="outline-3">
<h3 id="sec-1-15">Student Mentoring</h3>
<div class="outline-text-3" id="text-1-15">
</div><div id="outline-container-sec-1-15-1" class="outline-4">
<h4 id="sec-1-15-1">Masters Thesis Chair</h4>
<div class="outline-text-4" id="text-1-15-1">
<ul class="org-ul">
<li>Chelsea Bradley (Applied Psychology, Tarleton, in progress)
</li>
<li>Savannah Hines (Applied Psychology, Tarleton, in progress)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-15-2" class="outline-4">
<h4 id="sec-1-15-2">Doctoral Committees</h4>
<div class="outline-text-4" id="text-1-15-2">
<ul class="org-ul">
<li>Matthew Herzberg (Educational Leadership, Tarleton, in progress)
</li>
<li>Jeni McNeely (Educational Leadership, Tarleton, graduated 2016)
</li>
<li>Trina Geye (Psychology, TAMU-C, graduated 2016)
</li>
<li>Stephen McDaniel (Psychology, TAMU-C, in progress)
</li>
<li>Beth Nikopoulous (Psychology, TAMU-C, graduated 2015)
</li>
<li>Donna Peters (Psychology, TAMU-C, graduated 2013)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-15-3" class="outline-4">
<h4 id="sec-1-15-3">Masters Committees</h4>
<div class="outline-text-4" id="text-1-15-3">
<ul class="org-ul">
<li>Kody Lamb (Applied Psychology, Tarleton, in progress)
</li>
<li>Trina Geye (Psychology, TAMU-C, graduated 2015)
</li>
<li>Beth Nikopoulous (Psychology, TAMU-C, graduated 2013)
</li>
<li>Heather Oetker (Special Education, TAMU-C, graduated 2012)
</li>
<li>Joshua Patterson (Mathematics, TAMU-C, graduated 2011)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-15-4" class="outline-4">
<h4 id="sec-1-15-4">Honors Thesis Chair</h4>
<div class="outline-text-4" id="text-1-15-4">
<ul class="org-ul">
<li>Anissa Eid (Psychology, tarleton, in progress), <i>Cognitive mechanisms underlying spatial-numerical associations</i>
</li>
<li>Paige Woodard (Psychology, Tarleton, graduated 2017), <i>Mental arithmetic: Relationship between encoding and calculation processes</i>
</li>
<li>Sarah Montgomery (High Honors in Psychology, TAMU-C, graduated 2013), <i>Measuring the Working Memory Requirements of Mental Arithmetic</i>
</li>
<li>Emily Dalton (Honors in Psychology, TAMU-C, graduated 2013), <i>The Effects of Generation on False Memory for Numbers</i>
</li>
<li>Kaytlin Reid (Honors in Interdisciplinary Studies, TAMU-C, graduated 2013), <i>The Role of Working Memory in Mental Fraction Computation</i>
</li>
<li>Douglas Boney (Honors in Mathematics, TAMU-C, graduated 2013), <i>Knot Polynomials</i>
</li>
<li>Samantha Reece (Honors in Sociology, TAMU-C, graduated 2012), <i>The Effects of Stereotype Threat on Cheating Behavior in Mathematics</i>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-15-5" class="outline-4">
<h4 id="sec-1-15-5">Honors Thesis Committees</h4>
<div class="outline-text-4" id="text-1-15-5">
<ul class="org-ul">
<li>Carmen Phelps (English, TAMU-C, 2013)
</li>
<li>Morgan Lutz (Psychology, TAMU-C, 2013)
</li>
<li>Nick Bredberg (Physics, TAMU-C, 2012)
</li>
<li>Kallie Hinton (Mathematics Education, TAMU-C, 2011)
</li>
<li>Lindsey Preston (Mathematics Education, TAMU-C, 2011)
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-03-02 Fri 13:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
